import copy
import pandas as pd
import numpy as np
x_traine = [
    [0, 1, 0, 0, 1, 1, 0, 0, 1, 1, 1, 0, 1, 1, 0, 1],
    [1, 0, 1, 1, 0, 0, 1, 1, 0, 1, 1, 1, 0, 0, 1, 0],
    [0, 0, 0, 1, 1, 1, 0, 1, 1, 0, 1, 1, 1, 0, 0, 1],
    [0, 1, 1, 0, 0, 1, 1, 0, 0, 1, 1, 0, 0, 1, 1, 1],
    [1, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 1, 0],
    [0, 0, 1, 0, 1, 1, 1, 0, 1, 0, 1, 0, 1, 0, 1, 1],
    [1, 1, 0, 1, 0, 0, 0, 0, 1, 1, 0, 0, 1, 1, 1, 1],
    [0, 0, 1, 1, 0, 1, 1, 0, 1, 1, 1, 0, 1, 0, 1, 0],
    [0, 0, 1, 1, 0, 1, 0, 0, 1, 1, 0, 1, 1, 1, 0, 1],
    [0, 1, 1, 0, 0, 1, 1, 0, 0, 1, 1, 0, 1, 1, 1, 0],
    [1, 1, 1, 0, 1, 1, 0, 0, 1, 1, 0, 1, 0, 1, 0, 0],
    [1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 1, 0, 1, 1, 0],
    [1, 1, 0, 1, 1, 0, 1, 1, 1, 0, 0, 0, 1, 0, 0, 1],
    [0, 1, 1, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 1, 1, 1],
    [0, 1, 0, 1, 0, 1, 1, 1, 0, 1, 0, 0, 1, 1, 0, 1],
    [0, 1, 1, 1, 0, 0, 1, 1, 0, 0, 1, 0, 1, 0, 1, 1]
]

y_traine = [1,1,1,1,1,1,1,1,2,2,2,2,2,2,2,2]

df = pd.DataFrame(x_traine, columns=['Голова', 'Вуха', 'Ніс', 'Очі', 'Лоб', 'Складка', 'Губи', 'Волосся', 'Вуса',
                                     'Борода', 'Окуляри', 'Родимка', 'Метелик', 'Брови', 'Сережка', 'Трубка',])


df['Class'] = pd.Series(y_traine)

df.index = [i for i in range(1, len(y_traine)+1)]
df = df[df['Очі'].apply(lambda x: x == 1)] # менять 1 и 0 в х и менять ветку df['']

a = []

for i in df.columns[:-1]:
    a.append(df.groupby(['Class', i])[[i]].count()/df.groupby(['Class'])[[i]].count())


pr1 = df[df['Class'] == 1]['Class'].count()/df['Class'].count()
pr2 = df[df['Class'] == 2]['Class'].count()/df['Class'].count()


for i, j in zip(a, [1, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 1, 0]): # менять объект
    for cl in range(1, 3):
        if cl == 1:
            if (cl, j) not in i.index:
                pr1 *= 0
            else:
                pr1 *= i.loc[(cl,j), i.columns[0]]
        if cl == 2:
            if (cl, j) not in i.index:
                pr2 *= 0
            else:
                pr2 *= i.loc[(cl, j), i.columns[0]]


print(pr1)
pr_1 = pr1/(pr1+pr2)
pr_2 = pr2/(pr1+pr2)
print(pr_1, pr_2)